# ProfileMatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..ProfileMatch Property
PartMakerMethodToDivideVolumes Class See Also
---
Determines how two profiles match.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PartEdgeConditionOrientation ProfileMatch { get; set; }
```

Visual Basic
---
```text
Public Property ProfileMatch As PartEdgeConditionOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property PartEdgeConditionOrientation ProfileMatch {
	PartEdgeConditionOrientation get ();
	void set (PartEdgeConditionOrientation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace